package java_core_grom.mateAkademi.treni.forsobes.Exercise2;
/*Вам дается список городов. Каждое прямое сообщение между двумя городами имеет свою транспортную стоимость (целое число больше 0).
Цель - найти пути минимальной стоимости между парами городов. Предположим, что стоимость каждого пути
(которая представляет собой сумму затрат всех прямых соединений, принадлежащих этому пути)
не превышает 200000. Название города представляет собой строку, содержащую символы a, ..., z, и составляет не
более 10 длинные символы 2)
s [количество тестов <= 10]
n [количество городов <= 10000]
NAME-[название города]
p [количество соседей города NAME]
nr cost [nr - индекс города, подключенного к NAME (индекс первого города равен 1)]
            [cost - стоимость перевозки]
r [количество путей для поиска <= 100]
NAME1 NAME2 [NAME1 - источник, NAME2 - место назначения]
[пустая строка, разделяющая тесты]*/
public class FindThePaths {

}
